**** TODO 发布的软件串口功能关闭
     应该是直接关闭内核的串口驱动
**** TODO 关于应用程序加密[0%]
     将应用程序解密到内存中通过运行内容里面的软件来执行这样就不会出现
     通过文件系统破解的方法。
     原理就是需要使用内存申请和映射的方法来使用内存而不是简单的文件拷
     贝。这样使用普通的方法就无法得到解密之后的文件。
***** TODO 新的应用程序需要新的内核来配合
     在处理校验的时候应用程序也需要知道内核是否是配对的内核
     并且在新的内核发布的时候去掉串口输出。
     这样就无法使用其他的内核破解应用，使用当前的内核又不能进行交互。
**** WAITING 制作外置卡内容制作脚本
     CLOCK: [2013-02-26 Tue 10:37]--[2013-02-26 Tue 10:37] =>  0:00
     :PROPERTIES:
     :Effort:   90
     :END:
**** WAITING 解决使用48K声音播放会让声音过高并且声音过尖的问题。                :@work:
     CLOCK: [2013-01-29 Tue 15:26]--[2013-01-29 Tue 17:21] =>  1:55
     CLOCK: [2013-01-29 Tue 15:12]--[2013-01-29 Tue 15:26] =>  0:14
     CLOCK: [2013-01-29 Tue 14:55]--[2013-01-29 Tue 15:12] =>  0:17
     CLOCK: [2013-01-29 Tue 14:25]--[2013-01-29 Tue 14:55] =>  0:30
     CLOCK: [2013-01-29 Tue 11:52]--[2013-01-29 Tue 11:58] =>  0:06
     CLOCK: [2013-01-29 Tue 11:24]--[2013-01-29 Tue 11:52] =>  0:28
     CLOCK: [2013-01-29 Tue 11:16]--[2013-01-29 Tue 11:18] =>  0:02
     CLOCK: [2013-01-29 Tue 11:14]--[2013-01-29 Tue 11:15] =>  0:01
     CLOCK: [2013-01-28 Mon 17:25]--[2013-01-28 Mon 17:25] =>  0:00
     CLOCK: [2013-01-28 Mon 15:28]--[2013-01-28 Mon 17:25] =>  1:57
     CLOCK: [2013-01-28 Mon 15:27]--[2013-01-28 Mon 15:28] =>  0:01
     CLOCK: [2013-01-28 Mon 15:11]--[2013-01-28 Mon 15:12] =>  0:01
     CLOCK: [2013-01-28 Mon 11:48]--[2013-01-28 Mon 12:26] =>  0:38
     CLOCK: [2013-01-28 Mon 10:39]--[2013-01-28 Mon 11:48] =>  1:09
     CLOCK: [2013-01-18 Fri 11:48]--[2013-01-18 Fri 11:50] =>  0:02
     CLOCK: [2013-01-07 Mon 11:54]--[2013-01-07 Mon 12:33] =>  0:39
     CLOCK: [2013-01-07 Mon 11:34]--[2013-01-07 Mon 11:46] =>  0:12
     CLOCK: [2013-01-07 Mon 11:27]--[2013-01-07 Mon 11:34] =>  0:07
     CLOCK: [2013-01-07 Mon 10:39]--[2013-01-07 Mon 10:49] =>  0:10
     :PROPERTIES:
     :Effort:   24:00
     :END:
***** note
过查看代码一直到模拟ym2610的代码中。模拟器启动的时候设置的采样率参数是会影响ym2610的声音输出数据。如果想改善这个功能那么要么再继续深入ym2610的模拟器代码。查看声音产生的逻辑。势必要更了解这个IC需要花更多的时间。
有一直方法就是在写入声音的时候将产生的44100的声音数据重新采样成需要频率的声音数据。这个做法会影响模拟器的运行效率。
没有必要比较44100 48000两种模式输出的声音数据查看差别？
  
用的是ym2610声音播放IC，yamaha2610
z0是什么作用：z80是一个处理芯片，主要功能应该是用来和成声音并传输给
y2610进行播放.
  
新寻找了一个库？还是使用原来C++的代码？可以使用重新寻找的库，因为是
典的代码。如果使用了速度变慢那么还可以优化一下。
  
是尝试使用原来的代码。多做一次内存拷贝。如果不能使用的话。
***** libresample
      经过测试发现zitaresample的数据转换会影响其他内存。使用
      libresample来进行声音转换
      
***** zita resample
      不能正确转换16bit双声道数据从44100到48000
***** DONE 查找声音重采样的资料
      CLOSED: [2013-01-28 Mon 10:39]
      - CLOSING NOTE [2013-01-28 Mon 10:39]
****** DONE 阅读代码查看产生的数据和声音采样率之间的关系
      CLOCK: [2013-01-07 Mon 16:35]--[2013-01-07 Mon 16:35] =>  0:00
      CLOCK: [2013-01-07 Mon 15:09]--[2013-01-07 Mon 15:15] =>  0:06
要详细了解模拟ym2610的代码实现。另外的方式就是将输出的数据进行重采样再填充
  
****** DONE 搜索声音重采样相关的代码
 用 zita-resample作为重采样的实现代码
  
